{ "translations": {
    "New whiteboard" : "Nová tabule",
    "Create new whiteboard" : "Vytvořit novou tabuli",
    "Whiteboard" : "Tabule",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "URL WebSocket serveru není nastavená. Spolupráce v reálném čase vyžaduje zvlášť WebSocket server. Základní funkce tabule nicméně fungují i bez toho.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "Sdílené tajemství WebSocket serveru není nastavené. Toto je zapotřebí pro zabezpečené ověřování mezi Nextcloud a WebSocket serverem pro spolupráci v reálném čase.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "Nastavení WebSocket serveru je platné. Test spojení, založený na webovém prohlížeči, ověří skutečné připojení pro spolupráci v reálném čase.",
    "Whiteboard app" : "Aplikace Tabule",
    "Real-time collaboration server" : "Server pro spolupráci v reálném čase",
    "WebSocket server for real-time collaboration is configured and connected." : "WebSocket server pro spolupráci v reálném čase je nastavený a připojený.",
    "Failed to verify the connection:" : "Nepodařilo se ověřit připojení:",
    "Verifying connection…" : "Ověřování připojení…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "WebSocket server obsluhuje relace spolupráce mezi uživateli v reálném čase. Základní funkce tabule fungují i bez něho, ale pro spolupráci v reálném čase je zapotřebí, aby tento server byl spuštěný a přístupný z webových prohlížečů uživatelů.",
    "See the documentation on how to install and configure the WebSocket server." : "Ohledně pokynů pro instalaci a nastavení WebSocket serveru se podívejte do dokumentace.",
    "WebSocket server URL" : "URL WebSocket serveru",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL na které je WebSocket server pro spolupráci v reálném čase provozován. Je třeba, aby byla přístupná z webových prohlížečů uživatelů.",
    "Shared secret" : "Předsdílené heslo",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "JWT tajný klíč sdílený mezi Nextcloud a WebSocket serverem pro zabezpečené ověřování.",
    "Save settings" : "Uložit nastavení",
    "Advanced settings" : "Pokročilá nastavení",
    "Max file size" : "Nejvyšší umožněná velikost souboru",
    "Authentication Configuration Issue" : "Problém s nastavením ověřování se",
    "Authentication Error" : "Chyba ověřování se",
    "Unable to connect to collaboration server. The JWT secret may be misconfigured. You can continue working locally, and your changes will be saved to your device." : "Nebylo možné se připojit k serveru pro spolupráci. Je možné, že JWT tajemství není správně nastavené. Je možné pokračovat v práci lokálně a vámi provedené změny budou uloženy na vaše zařízení.",
    "Open Admin Settings" : "Otevřít nastavení pro správu",
    "Session Expired" : "Platnost relace skončila",
    "Access Denied" : "Přístup odepřen",
    "Authentication Issue" : "Problém s ověřováním se",
    "You do not have permission to access this whiteboard for collaboration. You can continue working locally." : "Nemáte oprávnění k přístupu k této tabuli pro spolupráci. Je ale možné pokračovat v práci lokálně.",
    "Local changes are automatically saved to your device. Collaboration features will be unavailable until this issue is resolved." : "Lokální změny jsou automaticky ukládány na vašem zařízení. Funkce pro spolupráci nebudou do vyřešení tohoto problému k dispozici.",
    "Show element creators" : "Zobrazit tvůrce prvku",
    "Display Mode" : "Režim zobrazení",
    "On Selection" : "Při výběru",
    "Drag to move" : "Přesuňte přetažením",
    "Download screenshot" : "Stáhnout si snímek obrazovky",
    "Offline" : "Bez připojení",
    "Offline - Changes saved locally." : "Bez připojení – změny uloženy lokálně.",
    "Connecting" : "Připojuje se",
    "Reconnecting" : "Znovunavazování spojení",
    "Online" : "Online",
    "Connected." : "Připojeno.",
    "Unknown" : "Neznámé",
    "Unknown connection status." : "Neznámý stav spojení.",
    "Stop presentation" : "Zastavit prezentaci",
    "Stop" : "Zastavit",
    "Start Presentation" : "Spustit prezentaci",
    "Start presenting to share your viewport with others" : "Pokud chcete zobrazit své zorné pole ostatním, zahajte prezentaci",
    "Stop Presentation" : "Zastavit prezentaci",
    "Stop presenting" : "Zastavit prezentování",
    "%s is presenting" : "%s prezentuje",
    "%s is currently presenting. Others will follow their viewport." : "%s v tuto chvíli prezentuje. Ostatní budou následovat svá zorná pole.",
    "Start Presentation (Offline)" : "Spustit prezentaci (offline)",
    "Presentation requires connection to collaboration server" : "Pro prezentaci je vyžadováno spojení se serverem pro spolupráci",
    "✓ Recording session prepared" : "✓ Nahrávání relace připraveno",
    "✓ Capture engine ready" : "✓ Engine pro zachytávání připraven",
    "• This may take a few seconds" : "• Toto může pár sekund trvat",
    "Stop Recording" : "Zastavit nahrávání",
    "Start Recording" : "Spustit nahrávání",
    "Viewing a previous version" : "Zobrazování předchozí verze",
    "Restore this version" : "Obnovit do podoby v této verzi",
    "Version {version}" : "Verze {version}",
    "Stored in trash history" : "Uloženo v historii koše",
    "Stored in file history" : "Uloženo v historii souborů",
    "Could not restore this version" : "Tuto verzi nebylo možné obnovit",
    "Version restored" : "Verze obnovena"
},"pluralForm" :"nplurals=4; plural=(n == 1 && n % 1 == 0) ? 0 : (n >= 2 && n <= 4 && n % 1 == 0) ? 1: (n % 1 != 0 ) ? 2 : 3;"
}