{ "translations": {
    "New whiteboard" : "Nová tabule",
    "Create new whiteboard" : "Vytvořit novou tabuli",
    "Whiteboard" : "Tabule",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "URL WebSocket serveru není nastavená. Spolupráce v reálném čase vyžaduje zvlášť WebSocket server. Základní funkce tabule nicméně fungují i bez toho.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "Sdílené tajemství WebSocket serveru není nastavené. Toto je zapotřebí pro zabezpečené ověřování mezi Nextcloud a WebSocket serverem pro spolupráci v reálném čase.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "Nastavení WebSocket serveru je platné. Test spojení, založený na webovém prohlížeči, ověří skutečné připojení pro spolupráci v reálném čase.",
    "Whiteboard app" : "Aplikace Tabule",
    "Real-time collaboration server" : "Server pro spolupráci v reálném čase",
    "WebSocket server for real-time collaboration is configured and connected." : "WebSocket server pro spolupráci v reálném čase je nastavený a připojený.",
    "Failed to verify the connection:" : "Nepodařilo se ověřit připojení:",
    "Verifying connection…" : "Ověřování připojení…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "WebSocket server obsluhuje relace spolupráce mezi uživateli v reálném čase. Základní funkce tabule fungují i bez něho, ale pro spolupráci v reálném čase je zapotřebí, aby tento server byl spuštěný a přístupný z webových prohlížečů uživatelů.",
    "See the documentation on how to install and configure the WebSocket server." : "Ohledně pokynů pro instalaci a nastavení WebSocket serveru se podívejte do dokumentace.",
    "WebSocket server URL" : "URL WebSocket serveru",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL na které je WebSocket server pro spolupráci v reálném čase provozován. Je třeba, aby byla přístupná z webových prohlížečů uživatelů.",
    "Shared secret" : "Předsdílené heslo",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "JWT tajný klíč sdílený mezi Nextcloud a WebSocket serverem pro zabezpečené ověřování.",
    "Save settings" : "Uložit nastavení",
    "Advanced settings" : "Pokročilá nastavení",
    "Max file size" : "Nejvyšší umožněná velikost souboru"
},"pluralForm" :"nplurals=4; plural=(n == 1 && n % 1 == 0) ? 0 : (n >= 2 && n <= 4 && n % 1 == 0) ? 1: (n % 1 != 0 ) ? 2 : 3;"
}