{ "translations": {
    "New whiteboard" : "Nouveau tableau blanc",
    "Create new whiteboard" : "Créer un nouveau tableau blanc",
    "Whiteboard" : "Tableau blanc",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "L'URL du serveur WebSocket n'est pas configurée. La collaboration en temps réel nécessite un serveur WebSocket dédié. Les fonctionnalités de base du tableau blanc restent disponibles sans.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "Pour garantir la collaboration en temps réel, vous devez configurer le secret partagé du serveur WebSocket. Ce paramètre est indispensable pour sécuriser l'authentification entre Nextcloud et le serveur WebSocket",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "La configuration du serveur WebSocket est valide. Nous allons maintenant procéder à un test de connexion dans le navigateur afin de vérifier la connectivité réelle pour la collaboration en temps réel.",
    "Whiteboard app" : "App tableau blanc",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "L'application officielle de tableau blanc de Nextcloud. Elle permet de créer et de partager des tableaux blancs, offrant ainsi la collaboration en temps réel entre utilisateurs\n\n**Le tableau blanc nécessite l'utilisation d'un serveur de collaboration dédié.** Veuillez consulter la [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) pour connaître la procédure d'installation.\n\n- 🎨 Dessiner des formes, écrire du texte, connecter des éléments\n- 📝 Collaboration en temps réel\n- 🖼️ Ajouter des images par glisser-déposer\n- 📊 Intégration simplifiée de diagrammes Mermaid\n- ✨ Utilisation du Sélecteur intelligent pour intégrer d'autres éléments de Nextcloud\n- 📦 Export d'images\n- 💪 Base solide : Notre solution repose sur la librairie Excalidraw.",
    "Real-time collaboration server" : "Serveur de collaboration en temps réel",
    "WebSocket server for real-time collaboration is configured and connected." : "La connexion au serveur WebSocket pour la collaboration en temps réel est établie.",
    "Failed to verify the connection:" : "Échec de la vérification de la connexion :",
    "Verifying connection…" : "Vérification de la connexion ...",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "Le serveur WebSocket assure la gestion des sessions de collaboration en temps réel entre les utilisateurs.\nLes fonctionnalités de base du tableau blanc restent disponibles sans lui, mais la collaboration en temps réel nécessite qu’il soit opérationnel et accessible depuis les navigateurs des utilisateurs.",
    "See the documentation on how to install and configure the WebSocket server." : "Consultez la documentation pour savoir comment installer et configurer le serveur WebSocket.",
    "WebSocket server URL" : "URL du serveur WebSocket",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "Adresse du serveur WebSocket utilisé pour la collaboration en temps réel.\nCette adresse doit être accessible depuis les navigateurs des utilisateurs.",
    "Shared secret" : "Secret partagé",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "Clé secrète JWT commune à Nextcloud et au serveur WebSocket pour une authentification sécurisée.",
    "Save settings" : "Enregistrer les paramètres",
    "Advanced settings" : "Paramètres avancés",
    "Max file size" : "Taille de fichier maximale",
    "Authentication Configuration Issue" : "Problème de configuration de l’accès.",
    "Authentication Error" : "Erreur d’authentification",
    "Unable to connect to collaboration server. The JWT secret may be misconfigured. You can continue working locally, and your changes will be saved to your device." : "Connexion au serveur de collaboration impossible. La clé secrète JWT semble mal configurée. Vous pouvez poursuivre votre travail en local ; les modifications seront enregistrées sur votre appareil.",
    "Temporary authentication issue. Retrying connection..." : "Problème d’authentification temporaire. Tentative de reconnexion…",
    "Open Admin Settings" : "Ouvrir les paramètres d’administration",
    "Session Expired" : "Session expirée",
    "Your session has expired. Attempting to refresh authentication..." : "Votre session a expiré. Tentative de renouvellement de l’authentification…",
    "Access Denied" : "Accès refusé",
    "Authentication Issue" : "Erreur d’authentification.",
    "Offline" : "Hors-ligne",
    "Connecting" : "Connexion en cours",
    "Online" : "En ligne",
    "Unknown" : "Inconnu",
    "Stop" : "Arrêter",
    "Restore this version" : "Restaurer cette version",
    "Version {version}" : "Version {version}",
    "Version restored" : "Version restaurée"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}