{ "translations": {
    "New whiteboard" : "Clár bán nua",
    "Create new whiteboard" : "Cruthaigh clár bán nua",
    "Whiteboard" : "Clár bán",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "Níl URL freastalaí WebSocket cumraithe. Éilíonn comhoibriú fíor-ama freastalaí WebSocket ar leithligh. Oibríonn feidhmiúlacht bhunúsach cláir bháin gan é.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "Níl rún comhroinnte freastalaí WebSocket cumraithe. Tá sé seo riachtanach le haghaidh fíordheimhniú slán idir Nextcloud agus freastalaí WebSocket le haghaidh comhoibriú fíor-ama.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "Tá cumraíocht fhreastalaí WebSocket bailí. Déanfaidh tástáil nasc bunaithe ar bhrabhsálaí fíorú ar an nascacht iarbhír le haghaidh comhoibriú fíor-ama.",
    "Whiteboard app" : "Clár bán aip",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "An aip oifigiúil ar an gclár bán le haghaidh Nextcloud. Ligeann sé d’úsáideoirí cláir bhána a chruthú agus a roinnt le húsáideoirí eile agus comhoibriú i bhfíor-am.\n\n**Tá freastalaí comhoibrithe ar leith ag teastáil ó Whiteboard chun oibriú.** Féach an [doiciméadú](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) maidir le conas é a shuiteáil.\n\n- 🎨 Cruthanna a tharraingt, téacs a scríobh, eilimintí a nascadh\n- 📝 Comhoibriú fíor-ama\n- 🖼️ Cuir íomhánna le tarraing agus scaoil\n- 📊 Cuir léaráidí maighdeana mara leis go héasca\n- ✨ Úsáid an Roghnóir Cliste chun gnéithe eile ó Nextcloud a leabú\n- 📦 Easpórtáil íomhá\n- 💪 Bunús láidir: Bainimid úsáid as Excalidraw mar ár mbunleabharlann",
    "Real-time collaboration server" : "Freastalaí comhoibrithe fíor-ama",
    "WebSocket server for real-time collaboration is configured and connected." : "Tá freastalaí WebSocket le haghaidh comhoibriú fíor-ama cumraithe agus ceangailte.",
    "Failed to verify the connection:" : "Theip ar an gceangal a fhíorú:",
    "Verifying connection…" : "Ceangal á fhíorú…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "Láimhseálann freastalaí WebSocket seisiúin chomhoibrithe fíor-ama idir úsáideoirí. Oibríonn feidhmiúlacht bhunúsach cláir bháin gan é, ach éilíonn comhoibriú fíor-ama go mbeidh an freastalaí seo ag rith agus inrochtana ó bhrabhsálaithe úsáideoirí.",
    "See the documentation on how to install and configure the WebSocket server." : "Féach ar an doiciméadú maidir le conas freastalaí WebSocket a shuiteáil agus a chumrú.",
    "WebSocket server URL" : "URL freastalaí WebSocket",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL ina bhfuil freastalaí WebSocket le haghaidh comhoibriú fíor-ama ag rith. Ní mór rochtain a bheith air ó bhrabhsálaithe úsáideoirí.",
    "Shared secret" : "Rún comhroinnte",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "Eochair rúnda JWT arna roinnt idir Nextcloud agus an freastalaí WebSocket le haghaidh fíordheimhniú slán.",
    "Save settings" : "Sábháil socruithe",
    "Advanced settings" : "Ardsocruithe",
    "Max file size" : "Uasmhéid comhaid",
    "Authentication Configuration Issue" : "Fadhb Cumraíochta Fíordheimhnithe",
    "Authentication Error" : "Earráid Fíordheimhnithe",
    "Unable to connect to collaboration server. The JWT secret may be misconfigured. You can continue working locally, and your changes will be saved to your device." : "Ní féidir ceangal leis an bhfreastalaí comhoibrithe. Seans go bhfuil rún JWT míchumraithe. Is féidir leat leanúint ar aghaidh ag obair go háitiúil, agus sábhálfar do chuid athruithe ar do ghléas.",
    "Temporary authentication issue. Retrying connection…" : "Fadhb shealadach fíordheimhnithe. Ag iarraidh ceangail arís…",
    "Open Admin Settings" : "Oscail Socruithe Riaracháin",
    "Session Expired" : "Seisiún imithe in éag",
    "Your session has expired. Attempting to refresh authentication…" : "Tá do sheisiún imithe in éag. Ag iarraidh an fhíordheimhniú a athnuachan…",
    "Access Denied" : "Rochtain Diúltaithe",
    "Authentication Issue" : "Fadhb Fíordheimhnithe",
    "You do not have permission to access this whiteboard for collaboration. You can continue working locally." : "Níl cead agat rochtain a fháil ar an gclár bán seo le haghaidh comhoibriú. Is féidir leat leanúint ar aghaidh ag obair go háitiúil.",
    "Authentication issue detected. Retrying…" : "Fadhb fíordheimhnithe braite. Ag iarraidh arís…",
    "Local changes are automatically saved to your device. Collaboration features will be unavailable until this issue is resolved." : "Sábháiltear athruithe áitiúla go huathoibríoch ar do ghléas. Ní bheidh gnéithe comhoibrithe ar fáil go dtí go réiteofar an fhadhb seo.",
    "This version is missing its source file" : "Tá an comhad foinse ar iarraidh ón leagan seo",
    "Could not load this version" : "Níorbh fhéidir an leagan seo a luchtú",
    "{fileName} – Version {version}" : "{fileName} – Leagan {version}",
    "Loading version..." : "Ag lódáil an leagan...",
    "Show element creators" : "Taispeáin cruthaitheoirí eilimintí",
    "Display Mode" : "Mód Taispeána",
    "On Selection" : "Ar Roghnú",
    "Drag to move" : "Tarraing le bogadh",
    "Export image…" : "Easpórtáil íomhá…",
    "Download screenshot" : "Íoslódáil an scáileán",
    "Offline" : "As líne",
    "Offline - Changes saved locally." : "As líne - Athruithe sábháilte go háitiúil.",
    "Connecting" : "Ag nascadh",
    "Connecting to collaboration server…" : "Ag ceangal leis an bhfreastalaí comhoibrithe…",
    "Reconnecting" : "Ag athcheangal",
    "Attempting to reconnect…" : "Ag iarraidh athcheangal…",
    "Online" : "Ar líne",
    "Connected." : "Ceangailte.",
    "Unknown" : "Anaithnid",
    "Unknown connection status." : "Stádas anaithnid ceangail.",
    "Authentication configuration issue detected." : "Braitheadh ​​fadhb chumraíochta fíordheimhnithe.",
    "Authentication issues detected." : "Braitheadh ​​fadhbanna fíordheimhnithe.",
    "Stop presentation" : "Stop an cur i láthair",
    "Stopping…" : "Ag stopadh…",
    "Stop" : "Stad",
    "Start Presentation" : "Tosaigh an Cur i Láthair",
    "Start presenting to share your viewport with others" : "Tosaigh ag cur i láthair chun do radharcphoirt a roinnt le daoine eile",
    "Stop Presentation" : "Stop an Cur i Láthair",
    "Stop presenting" : "Stop a chur i láthair",
    "Starting…" : "Ag tosú…",
    "Starting presentation…." : "Ag tosú cur i láthair….",
    "%s is presenting" : "Tá %s ag cur i láthair",
    "%s is currently presenting. Others will follow their viewport." : "Tá %s ag cur i láthair faoi láthair. Leanfaidh daoine eile a radharcphoirt.",
    "Start Presentation (Offline)" : "Tosaigh Cur i Láthair (As Líne)",
    "Presentation requires connection to collaboration server" : "Éilíonn cur i láthair nasc le freastalaí comhoibrithe",
    "Starting recording…" : "Ag tosú ag taifeadadh…",
    "• Preparing recording session…" : "• Ag ullmhú seisiún taifeadta…",
    "✓ Recording session prepared" : "✓ Seisiún taifeadta ullmhaithe",
    "• Initializing capture engine…" : "• Ag tosú inneall gabhála…",
    "• Waiting for capture engine…" : "• Ag fanacht leis an inneall gabhála…",
    "✓ Capture engine ready" : "✓ Inneall gabhála réidh",
    "• This may take a few seconds" : "• D’fhéadfadh sé seo cúpla soicind a thógáil",
    "Stop Recording" : "Stop a Thaifeadadh",
    "Start Recording" : "Tosaigh ag Taifeadadh",
    "Viewing a previous version" : "Ag féachaint ar leagan roimhe seo",
    "Restoring…" : "Ag athchóiriú…",
    "Restore this version" : "Athchóirigh an leagan seo",
    "Version {version}" : "Leagan {version}",
    "Stored in trash history" : "Stóráilte i stair an bhruscair",
    "Stored in file history" : "Stóráilte i stair na gcomhad",
    "Could not restore this version" : "Níorbh fhéidir an leagan seo a athchóiriú",
    "Version restored" : "Leagan athchóirithe"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}