{ "translations": {
    "New whiteboard" : "Clár bán nua",
    "Create new whiteboard" : "Cruthaigh clár bán nua",
    "Whiteboard" : "Clár bán",
    "Whiteboard server URL is not configured. Whiteboard requires a separate collaboration server that is connected to Nextcloud." : "Níl URL freastalaí an chláir bháin cumraithe. Teastaíonn freastalaí comhoibrithe ar leith ar an gclár bán atá ceangailte le Nextcloud.",
    "Nextcloud server could not connect to whiteboard server: %s" : "Níorbh fhéidir le freastalaí Nextcloud ceangal leis an bhfreastalaí clár bán: %s",
    "No version provided by /status enpdoint" : "Níl aon leagan curtha ar fáil ag críochphointe /stádas",
    "Backend server is running a different version, make sure to upgrade both to the same version. App: %s Backend version: %s" : "Tá leagan eile á rith ag freastalaí Inneall, déan cinnte an dá cheann a uasghrádú go dtí an leagan céanna. Aip: %s Leagan cúl: %s",
    "Whiteboard backend server could not reach Nextcloud: %s" : "Níorbh fhéidir le freastalaí inneall an chláir bháin Nextcloud: %s",
    "Failed to connect to whiteboard server status endpoint: %s" : "Níorbh fhéidir ceangal le críochphointe stádais freastalaí an chláir bháin: %s",
    "Whiteboard server configured properly" : "Freastalaí clár bán cumraithe i gceart",
    "Whiteboard app" : "Clár bán aip",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "An aip oifigiúil ar an gclár bán le haghaidh Nextcloud. Ligeann sé d’úsáideoirí cláir bhána a chruthú agus a roinnt le húsáideoirí eile agus comhoibriú i bhfíor-am.\n\n**Tá freastalaí comhoibrithe ar leith ag teastáil ó Whiteboard chun oibriú.** Féach an [doiciméadú](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) maidir le conas é a shuiteáil.\n\n- 🎨 Cruthanna a tharraingt, téacs a scríobh, eilimintí a nascadh\n- 📝 Comhoibriú fíor-ama\n- 🖼️ Cuir íomhánna le tarraing agus scaoil\n- 📊 Cuir léaráidí maighdeana mara leis go héasca\n- ✨ Úsáid an Roghnóir Cliste chun gnéithe eile ó Nextcloud a leabú\n- 📦 Easpórtáil íomhá\n- 💪 Bunús láidir: Bainimid úsáid as Excalidraw mar ár mbunleabharlann",
    "Whiteboard server" : "Freastalaí clár bán",
    "Whiteboard backend server is configured and connected." : "Tá freastalaí inneall an chláir bháin cumraithe agus nasctha.",
    "Failed to verify the connection:" : "Theip ar an gceangal a fhíorú:",
    "Verifying connection…" : "Ceangal á fhíorú…",
    "Whiteboard requires a separate collaboration server that is connected to Nextcloud." : "Teastaíonn freastalaí comhoibrithe ar leith ar an gclár bán atá ceangailte le Nextcloud.",
    "See the documentation on how to install it." : "Féach ar an doiciméadú ar conas é a shuiteáil.",
    "Whiteboard server URL" : "URL freastalaí an chláir bháin",
    "This URL is used by the browser to connect to the whiteboard server." : "Úsáideann an brabhsálaí an URL seo chun ceangal leis an bhfreastalaí clár bán.",
    "Internal whiteboard server URL" : "URL freastalaí clár bán inmheánach",
    "This URL is used by the Nextcloud server to connect to the whiteboard server." : "Úsáideann freastalaí Nextcloud an URL seo chun ceangal leis an bhfreastalaí clár bán.",
    "Skip TLS certificate validation (not recommended)" : "Léim thar bhailíochtú teastais TLS (ní mholtar)",
    "Shared secret" : "Rún comhroinnte",
    "Save settings" : "Sábháil socruithe",
    "Advanced settings" : "Ardsocruithe",
    "Max file size" : "Uasmhéid comhaid"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}