{ "translations": {
    "New whiteboard" : "Novo encerado",
    "Create new whiteboard" : "Crear un novo encerado",
    "Whiteboard" : "Encerado dixital",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "O URL do servidor WebSocket non está configurado. A colaboración en tempo real precisa dun servidor individual de WebSocket. A funcionalidade básica do encerado traballa sen el.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "O segredo compartido do servidor WebSocket non está configurado. Isto precisase para a autenticación segura entre Nextcloud e o servidor WebSocket para a colaboración en tempo real.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "A configuración do servidor WebSocket é válida. Unha proba de conexión baseada no navegador verificará a conexión para colaboración en tempo real.",
    "Whiteboard app" : "Aplicación do encerado dixital",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "A aplicación oficial de Encerado para Nextcloud. Permite aos usuarios crear e compartir encerados con outros usuarios e colaborar en tempo real.\n\n**Encerado require un servidor de colaboración separado para funcionar.** Consulte a [documentación](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) sobre como instalalo.\n\n- 🎨 Debuxar formas, escribir texto, conectar elementos\n- 📝 Colaboración en tempo real\n- 🖼️ Engadir imaxes arrastrando e soltando\n- 📊 Engadir doadamente diagramas con Mermaid\n- ✨ Usar o selector intelixente para inserir outros elementos de Nextcloud\n- 📦 Exportación de imaxes\n- 💪 Base sólida: usamos Excalidraw como biblioteca base",
    "Real-time collaboration server" : "Servidor de colaboración en tempo real",
    "WebSocket server for real-time collaboration is configured and connected." : "O servidor WebSocket para colaboración en tempo real está configurado e conectado.",
    "Failed to verify the connection:" : "Produciuse un fallo ao verificar a conexión:",
    "Verifying connection…" : "Verificando a conexión…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "O servidor WebSocket xestiona as sesións de colaboración en tempo real entre usuarios. A funcionalidades básicas do encerado traballan en el, mais a colaboración en tempo real precisa que este servidor estea funcionando e que sexa accesíbel desde os navegadores dos usuarios.",
    "See the documentation on how to install and configure the WebSocket server." : "Consulte a documentación sobre como instalar e configurar o servidor WebSocket.",
    "WebSocket server URL" : "URL do servidor WebSocket",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL onde se executa o servidor WebSocket para colaboración en tempo real. Debe ser accesíbel desde os navegadores dos usuarios.",
    "Shared secret" : "Segredo compartido",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "Chave secreta JWT compartida entre Nextcloud e o servidor WebSocket para unha autenticación segura.",
    "Save settings" : "Gardar os axustes",
    "Advanced settings" : "Axustes avanzados",
    "Max file size" : "Tamaño máximo do ficheiro"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}