{ "translations": {
    "New whiteboard" : "Nuova lavagna",
    "Create new whiteboard" : "Crea nuova lavagna",
    "Whiteboard" : "Lavagna",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "L'URL del server WebSocket non è configurato. La collaborazione in tempo reale richiede un server WebSocket separato. Le funzionalità di base della lavagna funzionano anche senza.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "Il segreto condiviso del server WebSocket non è configurato. Questo è necessario per l'autenticazione sicura tra Nextcloud e il server WebSocket per la collaborazione in tempo reale.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "La configurazione del server WebSocket è valida. Il test di connessione basato sul browser verificherà l'effettiva connettività per la collaborazione in tempo reale.",
    "Whiteboard app" : "App per lavagna",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "L'app ufficiale per lavagna per Nextcloud. Consente agli utenti di creare e condividere lavagne con altri utenti e collaborare in tempo reale.\n\n**La lavagna richiede un server di collaborazione separato per funzionare.** Consulta la [documentazione](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) per informazioni su come installarla.\n\n- 🎨 Disegna forme, scrivi testo, collega elementi\n- 📝 Collaborazione in tempo reale\n- 🖼️ Aggiungi immagini con trascinamento della selezione\n- 📊 Aggiungi facilmente diagrammi a sirena\n- ✨ Utilizza Smart Picker per incorporare altri elementi da Nextcloud\n- 📦 Esportazione delle immagini\n- 💪 Solide basi: utilizziamo Excalidraw come libreria di base",
    "Real-time collaboration server" : "Server di collaborazione in tempo reale",
    "WebSocket server for real-time collaboration is configured and connected." : "Il server WebSocket per la collaborazione in tempo reale è configurato e connesso.",
    "Failed to verify the connection:" : "Impossibile verificare la connessione:",
    "Verifying connection…" : "Verifica della connessione…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "Il server WebSocket gestisce le sessioni di collaborazione in tempo reale tra gli utenti. Le funzionalità di base della lavagna funzionano anche senza di esso, ma la collaborazione in tempo reale richiede che questo server sia in esecuzione e accessibile dai browser degli utenti.",
    "See the documentation on how to install and configure the WebSocket server." : "Consultare la documentazione su come installare e configurare il server WebSocket.",
    "WebSocket server URL" : "URL del server WebSocket",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL in cui è in esecuzione il server WebSocket per la collaborazione in tempo reale. Deve essere accessibile dai browser degli utenti.",
    "Shared secret" : "Segreto condiviso",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "Chiave segreta JWT condivisa tra Nextcloud e il server WebSocket per l'autenticazione sicura.",
    "Save settings" : "Salva impostazioni",
    "Advanced settings" : "Impostazioni avanzate",
    "Max file size" : "Dimensione massima del file",
    "Offline" : "Offline",
    "Connecting" : "Connessione in corso",
    "Online" : "In linea",
    "Unknown" : "Sconosciuto",
    "Stop" : "Ferma",
    "Restore this version" : "Ripristina questa versione",
    "Version {version}" : "Versione {version}",
    "Version restored" : "Versione ripristinata"
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}