{ "translations": {
    "New whiteboard" : "Novo quadro branco",
    "Create new whiteboard" : "Criar novo quadro branco",
    "Whiteboard" : "Quadro branco",
    "WebSocket server URL is not configured. Real-time collaboration requires a separate WebSocket server. Basic whiteboard functionality works without it." : "O URL do servidor WebSocket não está configurado. A colaboração em tempo real requer um servidor WebSocket separado. A funcionalidade básica do quadro branco funciona sem ele.",
    "WebSocket server shared secret is not configured. This is required for secure authentication between Nextcloud and the WebSocket server for real-time collaboration." : "O segredo compartilhado do servidor WebSocket não está configurado. Isso é necessário para a autenticação segura entre o Nextcloud e o servidor WebSocket para colaboração em tempo real.",
    "WebSocket server configuration is valid. Browser-based connection test will verify actual connectivity for real-time collaboration." : "A configuração do servidor WebSocket é válida. O teste de conexão baseado em navegador verificará a conectividade real para colaboração em tempo real.",
    "Whiteboard app" : "Aplicativo Quadro Branco",
    "The official whiteboard app for Nextcloud. It allows users to create and share whiteboards with other users and collaborate in real-time.\n\n**Whiteboard requires a separate collaboration server to work.** Please see the [documentation](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) on how to install it.\n\n- 🎨 Drawing shapes, writing text, connecting elements\n- 📝 Real-time collaboration\n- 🖼️ Add images with drag and drop\n- 📊 Easily add mermaid diagrams\n- ✨ Use the Smart Picker to embed other elements from Nextcloud\n- 📦 Image export\n- 💪 Strong foundation: We use Excalidraw as our base library" : "O aplicativo oficial de quadros brancos para o Nextcloud. Ele permite que os usuários criem e compartilhem quadros brancos com outros usuários e colaborem em tempo real.\n\n**Quadro branco branco requer um servidor de colaboração separado para funcionar. Consulte a [documentação](https://github.com/nextcloud/whiteboard?tab=readme-ov-file#backend) para saber como instalá-lo.\n\n- 🎨 Desenhar formas, escrever textos, conectar elementos\n- 📝 Colaboração em tempo real\n- 🖼️ Adicione imagens com o recurso de arrastar e soltar\n- 📊 Adicione facilmente diagramas de Mermaid\n- ✨ Use o Seletor Inteligente para incorporar outros elementos do Nextcloud\n- 📦 Exportação como imagem\n- 💪 Fundação forte: usamos o Excalidraw como nossa biblioteca base",
    "Real-time collaboration server" : "Servidor de colaboração em tempo real",
    "WebSocket server for real-time collaboration is configured and connected." : "O servidor WebSocket para colaboração em tempo real está configurado e conectado.",
    "Failed to verify the connection:" : "Falha ao verificar a conexão:",
    "Verifying connection…" : "Verificando conexão…",
    "The WebSocket server handles real-time collaboration sessions between users. Basic whiteboard functionality works without it, but real-time collaboration requires this server to be running and accessible from users' browsers." : "O servidor WebSocket lida com sessões de colaboração em tempo real entre usuários. A funcionalidade básica do quadro branco funciona sem ele, mas a colaboração em tempo real exige que este servidor esteja em execução e acessível a partir dos navegadores dos usuários.",
    "See the documentation on how to install and configure the WebSocket server." : "Consulte a documentação sobre como instalar e configurar o servidor WebSocket.",
    "WebSocket server URL" : "URL do servidor WebSocket",
    "URL where the WebSocket server for real-time collaboration is running. Must be accessible from users' browsers." : "URL onde o servidor WebSocket para colaboração em tempo real está sendo executado. Deve ser acessível a partir dos navegadores dos usuários.",
    "Shared secret" : "Segredo compartilhado",
    "JWT secret key shared between Nextcloud and the WebSocket server for secure authentication." : "Chave secreta JWT compartilhada entre o Nextcloud e o servidor WebSocket para autenticação segura.",
    "Save settings" : "Salvar configurações",
    "Advanced settings" : "Configurações avançadas",
    "Max file size" : "Tamanho máximo de arquivo",
    "Access Denied" : "Acesso Negado",
    "Offline" : "Off-line",
    "Connecting" : "Conectando",
    "Online" : "On-line",
    "Stop" : "Encerrar"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}